betfair/templates/aus/BFExchangeService.getAllMarkets.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:getAllMarkets>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<locale></locale>
<eventTypeIds>
<ns2:int>0</ns2:int>
<ns2:int>0</ns2:int>
</eventTypeIds>
<countries>
<ns2:Country></ns2:Country>
<ns2:Country></ns2:Country>
</countries>
<fromDate>2012-05-16T18:47:03Z</fromDate>
<toDate>2012-05-16T18:47:03Z</toDate>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:getAllMarkets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
